Repository: DCT-Berinyuy/book-bridge
Catalog: lib/l10n/app_*.arb
Languages: fr

source: Home
fr: Accueil

source: Search
fr: Rechercher

source: Sell
fr: Vendre

source: Profile
fr: Profil

source: Favorites
fr: Favoris

source: NEARBY
fr: PROXIMITÉ

source: DONATE
fr: DONNER

# discoverBooks
source: Discover books in your community
fr: Découvrez des livres dans votre communauté

# supportCommunity
source: Support the BookBridge Community
fr: Soutenir la communauté BookBridge

# supportDescription
source: Your contribution helps us keep the platform free and accessible for all students.
fr: Votre contribution nous aide à garder la plateforme gratuite et accessible à tous les étudiants.

# giveBooks
source: Give books, create impact
fr: Donnez des livres, créez un impact

source: Explore Now
fr: Explorer maintenant

source: Give Now
fr: Donner maintenant

source: Featured Books
fr: Livres en vedette

source: Your nearby books
fr: Vos livres à proximité

source: Recent Listings
fr: Annonces récentes

# searchHint
source: Search title, author, or ISBN...
fr: Rechercher un titre, un auteur ou un ISBN...

source: No Books Found
fr: Aucun livre trouvé

source: Explore Nearby
fr: Explorer à proximité

source: Categories
fr: Catégories

source: All
fr: Tous

source: VERIFIED
fr: VÉRIFIÉ

# signInTitle
source: Welcome back!
fr: Bon retour !

# signInSubtitle
source: Sign in to continue
fr: Connectez-vous pour continuer

# signUpTitle
source: Join BookBridge
fr: Rejoindre BookBridge

# signUpSubtitle
source: Create an account to start browsing
fr: Créez un compte pour commencer à explorer

# passwordLabel
source: Password
fr: Mot de passe

# signInButton
source: Sign In
fr: Se connecter

# signUpButton
source: Sign Up
fr: S'inscrire

source: Forgot Password?
fr: Mot de passe oublié ?

# googleSignIn
source: Sign in with Google
fr: Se connecter avec Google

# noAccount
source: Don't have an account?
fr: Vous n'avez pas de compte ?

# haveAccount
source: Already have an account?
fr: Vous avez déjà un compte ?

# appBranding
source: BookBridge: Knowledge for All
fr: BookBridge : Le savoir pour tous

# appTagline
source: Democratizing access to affordable books in Cameroon.
fr: Démocratiser l'accès à des livres abordables au Cameroun.

source: OR
fr: OU

# emailHint
source: student@university.cm
fr: etudiant@university.cm

# resetPasswordTitle
source: Reset Password
fr: Réinitialiser le mot de passe

# resetPasswordContent
source: Enter your email address to receive a password reset link.
fr: Entrez votre adresse e-mail pour recevoir un lien de réinitialisation.

source: Cancel
fr: Annuler

source: Send Link
fr: Envoyer le lien

# emailRequired
source: Email is required
fr: L'e-mail est requis

# emailInvalid
source: Enter a valid email address
fr: Entrez une adresse e-mail valide

# passwordRequired
source: Password is required
fr: Le mot de passe est requis

# passwordTooShort
source: Password must be at least 6 characters
fr: Le mot de passe doit comporter au moins 6 caractères

# signUpSuccess
source: Sign up successful! Welcome.
fr: Inscription réussie ! Bienvenue.

# appMarketingHeadline
source: Connecting students, authors, and bookshops to end learning poverty.
fr: Connecter les étudiants, les auteurs et les librairies pour mettre fin à la pauvreté de l'apprentissage.

# fullNameLabel
source: Full Name
fr: Nom complet

# fullNameHint
source: e.g. John Doe
fr: ex. Jean Dupont

# fullNameRequired
source: Full name is required
fr: Le nom complet est requis

# localityLabel
source: Locality / Neighborhood
fr: Localité / Quartier

# localityHint
source: e.g. Molyko, Buea
fr: ex. Molyko, Buea

# localityRequired
source: Locality is required
fr: La localité est requise

# whatsappLabel
source: WhatsApp Number
fr: Numéro WhatsApp

# whatsappHint
source: e.g. 677...
fr: ex. 677...

# whatsappRequired
source: WhatsApp number is required
fr: Le numéro WhatsApp est requis

# whatsappInvalid
source: Enter a valid 9-digit number
fr: Entrez un numéro valide à 9 chiffres

# passwordRequirement
source: Min. 6 characters
fr: Min. 6 caractères

# pricesListedIn
source: PRICES ARE LISTED IN FCFA
fr: LES PRIX SONT INDIQUÉS EN FCFA

# logInButton
source: Log In
fr: Se connecter

# shareTextCheckOut
source: Check out this book on BookBridge:
fr: Découvrez ce livre sur BookBridge :

# shareTextDownload
source: Download BookBridge to view more details!
fr: Téléchargez BookBridge pour plus de détails !

# whatsappNotAvailable
source: No WhatsApp number available
fr: Aucun numéro WhatsApp disponible

# whatsappDefaultMessage
source: Hi, I saw your book on BookBridge and I am interested!
fr: Bonjour, j'ai vu votre livre sur BookBridge et je suis intéressé(e) !

# whatsappLaunchError
source: Could not launch WhatsApp
fr: Impossible de lancer WhatsApp

# errorPrefix
source: Error:
fr: Erreur :

# phoneNotAvailable
source: No phone number available
fr: Aucun numéro de téléphone disponible

# dialerLaunchError
source: Could not launch dialer
fr: Impossible de lancer le numéroteur

# bookDetailsTitle
source: Book Details
fr: Détails du livre

source: Failed to load listing
fr: Échec du chargement de l'annonce

# listingNotAvailableSnackBar
source: This listing is no longer available.
fr: Cette annonce n'est plus disponible.

source: Buy-Back Eligible
fr: Éligible au rachat

# buyBackDescription
source: Sell this book back to the platform when you're done.
fr: Revendez ce livre à la plateforme quand vous aurez fini.

# sellerTypeIndividualDesc
source: This student is selling to fund their next semester.
fr: Cet étudiant vend pour financer son prochain semestre.

# sellerTypeBookshopDesc
source: A verified local bookshop supporting the community.
fr: Une librairie locale vérifiée soutenant la communauté.

# sellerTypeAuthorDesc
source: Direct from the author. Supporting local creativity.
fr: Directement de l'auteur. Soutien à la créativité locale.

source: No description provided.
fr: Aucune description fournie.

# sellerInformationLabel
source: SELLER INFORMATION
fr: INFORMATIONS SUR LE VENDEUR

source: Unknown Seller
fr: Vendeur inconnu

source: Unknown Location
fr: Emplacement inconnu

# sellerTypeBookshopPromo
source: Supporting local businesses democratizes access to knowledge.
fr: Soutenir les entreprises locales démocratise l'accès au savoir.

# sellerTypeAuthorPromo
source: Supporting local authors fosters a vibrant culture of learning.
fr: Soutenir les auteurs locaux favorise une culture d'apprentissage dynamique.

# contactSellerWhatsApp
source: Contact Seller via WhatsApp
fr: Contacter le vendeur via WhatsApp

source: Call Seller
fr: Appeler le vendeur

# categoryTextbooks
source: Textbooks
fr: Manuels Scolaires

# categoryHistory
source: History
fr: Histoire

# categoryBusiness
source: Business
fr: Commerce

# categoryTechnology
source: Technology
fr: Technologie

# categoryLanguage
source: Language
fr: Langue

# categoryMathematics
source: Mathematics
fr: Mathématiques

# categoryEngineering
source: Engineering
fr: Ingénierie

# categoryMedicine
source: Medicine
fr: Médecine

# sellSuccessUpdate
source: Listing updated successfully!
fr: Annonce mise à jour avec succès !

# sellSuccessCreate
source: Listing created successfully!
fr: Annonce créée avec succès !

source: Select Image Source
fr: Sélectionner la source de l'image

source: Gallery
fr: Galerie

source: Camera
fr: Appareil photo

source: Edit Listing
fr: Modifier l'annonce

source: Sell a Book
fr: Vendre un livre

# bookTitleLabel
source: Book Title
fr: Titre du livre

# bookTitleHint
source: e.g. Pure Physics
fr: ex. Physique Pure

# bookTitleRequired
source: Please enter a title
fr: Veuillez entrer un titre

# authorLabel
source: Author
fr: Auteur

# authorHint
source: e.g. Nelkon & Parker
fr: ex. Nelkon & Parker

# authorRequired
source: Please enter an author
fr: Veuillez entrer un auteur

# priceLabel
source: Price (FCFA)
fr: Prix (FCFA)

# priceRequired
source: Please enter a price
fr: Veuillez entrer un prix

# priceInvalid
source: Please enter a valid price
fr: Veuillez entrer un prix valide

# descriptionFieldHint
source: Describe the book (edition, language, etc.)
fr: Décrivez le livre (édition, langue, etc.)

# bookConditionLabel
source: Book Condition
fr: État du livre

# conditionNew
source: New
fr: Neuf

# conditionLikeNew
source: Like New
fr: Comme neuf

# conditionGood
source: Good
fr: Bon

# conditionFair
source: Fair
fr: Passable

# conditionPoor
source: Poor
fr: Médiocre

# categoryLabel
source: Category
fr: Catégorie

# selectCategoryHint
source: Select a category
fr: Sélectionnez une catégorie

source: None
fr: Aucune

source: Social Venture Features
fr: Fonctionnalités sociales

# sellerTypeLabel
source: Seller Type
fr: Type de vendeur

# sellerTypeIndividual
source: Individual Student
fr: Étudiant individuel

# sellerTypeBookshop
source: Verified Bookshop
fr: Librairie vérifiée

# sellerTypeAuthor
source: Local Author
fr: Auteur local

source: Eligible for Buy-Back
fr: Éligible au rachat

# buyBackSwitchDesc
source: Permit students to sell this book back when finished.
fr: Permettre aux étudiants de revendre ce livre une fois terminé.

# availableStockLabel
source: Available Stock
fr: Stock disponible

# stockHint
source: e.g. 10
fr: ex. 10

# locationInfo
source: Listing will be visible in your current region
fr: L'annonce sera visible dans votre région actuelle

# updateListingButton
source: Update Listing
fr: Mettre à jour l'annonce

# postListingButton
source: Post Listing
fr: Publier l'annonce

source: Add book photos
fr: Ajouter des photos du livre

source: What is your interest?
fr: Quel est votre intérêt ?

source: Academic Categories
fr: Catégories académiques

source: No categories available
fr: Aucune catégorie disponible

source: Recent Searches
fr: Recherches récentes

source: Clear All
fr: Tout effacer

source: An error occurred
fr: Une erreur s'est produite

# noResultsFoundFor
source: No results found for "{query}"
fr: Aucun résultat trouvé pour "{query}"

# resultsFoundCount
source: {count, plural, =0{No results found} =1{1 result found} other{{count} results found}}
fr: {count, plural, =0{Aucun résultat trouvé} =1{1 résultat trouvé} other{{count} résultats trouvés}}

source: Cameroon
fr: Cameroun

source: My Books
fr: Mes livres

source: No Books Listed Yet
fr: Aucun livre répertorié

# startSellingPrompt
source: Start selling by listing your first book!
fr: Commencez à vendre en publiant votre premier livre !

# listFirstBookButton
source: List Your First Book
fr: Publier votre premier livre

# failedToLoadMyBooks
source: Failed to Load Your Books
fr: Échec du chargement de vos livres

source: Please try again
fr: Veuillez réessayer

source: Try Again
fr: Réessayer

# deleteListingTitle
source: Delete Listing
fr: Supprimer l'annonce

# deleteListingConfirmation
source: Are you sure you want to delete this listing? This action cannot be undone.
fr: Êtes-vous sûr de vouloir supprimer cette annonce ? Cette action est irréversible.

source: Delete
fr: Supprimer

source: Edit
fr: Modifier

source: Listing deleted successfully
fr: Annonce supprimée avec succès

# failedToDeleteNotification
source: Failed to delete: {error}
fr: Échec de la suppression : {error}

# statusAvailable
source: Available
fr: Disponible

# statusSold
source: Sold
fr: Vendu

source: Recently Added
fr: Récemment ajoutés

# somethingWentWrong
source: Oops! Something Went Wrong
fr: Oups ! Quelque chose s'est mal passé

# checkConnection
source: Please check your connection.
fr: Veuillez vérifier votre connexion.

source: Back to Home
fr: Retour à l'accueil

# firstListingPrompt
source: Be the first to list a book in your area!
fr: Soyez le premier à publier un livre dans votre région !

# tryAnotherCategory
source: Try another category or clear the filter.
fr: Essayez une autre catégorie ou effacez le filtre.

# noBooksIn
source: No Books in {category}
fr: Aucun livre dans {category}

source: Account
fr: Compte

source: Edit Profile
fr: Modifier le profil

source: Logout
fr: Se déconnecter

source: User not found
fr: Utilisateur non trouvé

source: My Account
fr: Mon compte

source: My Profile Edit
fr: Modifier mon profil

source: My Favourites
fr: Mes favoris

source: More
fr: Plus

source: Privacy Policy
fr: Politique de confidentialité

source: Terms & Conditions
fr: Termes et conditions

source: Help & Support
fr: Aide et support

source: Feedback
fr: Retours

source: Contact Us
fr: Contactez-nous

source: Invite friends
fr: Inviter des amis

# inviteMessage
source: Join me on BookBridge, the peer-to-peer marketplace for used books in Cameroon! 📚✨ Download or visit us at: https://book-bridge-three.vercel.app/
fr: Rejoignez-moi sur BookBridge, la plateforme d'échange de livres d'occasion au Cameroun ! 📚✨ Téléchargez ou visitez-nous sur : https://book-bridge-three.vercel.app/

# inviteSubject
source: Invite to BookBridge
fr: Invitation à BookBridge

source: About BookBridge
fr: À propos de BookBridge

source: Active Books
fr: Livres actifs

source: Total Value
fr: Valeur totale

source: Follow Us
fr: Suivez-nous

# logoutConfirmTitle
source: Logout
fr: Déconnexion

# logoutConfirmMessage
source: Are you sure you want to logout?
fr: Êtes-vous sûr de vouloir vous déconnecter ?

# profileUpdatedSuccess
source: Profile updated successfully!
fr: Profil mis à jour avec succès !

# profileUpdateFailed
source: Failed to update profile.
fr: Échec de la mise à jour du profil.

source: Full Name
fr: Nom complet

# enterFullName
source: Please enter your full name
fr: Veuillez entrer votre nom complet

source: Locality / Neighborhood
fr: Localité / Quartier

source: WhatsApp Number
fr: Numéro WhatsApp

source: Save Changes
fr: Enregistrer les modifications

source: Complete Your Profile
fr: Complétez votre profil

source: Just one more step!
fr: Encore une étape !

# completeProfileSubtitle
source: To start buying and selling, we need a few more details to help other students find you.
fr: Pour commencer à acheter et vendre, nous avons besoin de quelques détails supplémentaires pour aider les autres étudiants à vous trouver.

# numberRequired
source: Number is required
fr: Le numéro est requis

# enterValidNumber
source: Enter a valid 9-digit number
fr: Entrez un numéro valide à 9 chiffres

source: Complete Setup
fr: Terminer la configuration

# aboutDescription
source: BookBridge is a peer-to-peer marketplace designed for students in Cameroon. Our mission is to make educational resources accessible and affordable by connecting students who want to sell their used books with those who need them.
fr: BookBridge est une plateforme d'échange entre pairs conçue pour les étudiants au Cameroun. Notre mission est de rendre les ressources éducatives accessibles et abordables en connectant les étudiants qui souhaitent vendre leurs livres d'occasion avec ceux qui en ont besoin.

source: Project Source Code
fr: Code source du projet

source: View on GitHub
fr: Voir sur GitHub

source: Official Website
fr: Site officiel

# visitWebPlatform
source: Visit our web platform
fr: Visitez notre plateforme web

# connectWithAuthor
source: Connect with {name}
fr: Connectez-vous avec {name}

# copyright
source: © {year} DCT-Berinyuy. All rights reserved.
fr: © {year} DCT-Berinyuy. Tous droits réservés.

source: Mark all as read
fr: Tout marquer comme lu

# errorWithDetails
source: Error: {error}
fr: Erreur : {error}

source: No Notifications Yet
fr: Aucune notification pour le moment

# notificationsEmptySubtitle
source: You'll see alerts about your listings, messages, and activity here.
fr: Vous verrez ici les alertes concernant vos annonces, vos messages et votre activité.

# myFavorites
source: My Favourites
fr: Mes Favoris

source: Retry
fr: Réessayer

source: No favorites yet
fr: Aucun favori pour le moment

# favoritesEmptySubtitle
source: Books you heart will appear here.
fr: Les livres que vous aimez apparaîtront ici.

source: Explore Books
fr: Explorer les livres

# unknownError
source: An unknown error occurred.
fr: Une erreur inconnue s'est produite.

# passwordResetSent
source: Password reset link sent!
fr: Le lien de réinitialisation du mot de passe a été envoyé !

source: CAMEROON • FCFA
fr: CAMEROUN • FCFA

source: Send Feedback
fr: Envoyer un commentaire

# pleaseEnterFeedback
source: Please enter your feedback
fr: Veuillez saisir votre commentaire

# feedbackSuccess
source: Thank you for your feedback!
fr: Merci pour votre commentaire !

# feedbackError
source: Failed to send feedback: {error}
fr: Échec de l'envoi du commentaire : {error}

# weValueInput
source: We value your input!
fr: Votre avis nous intéresse !

# feedbackSubtitle
source: Tell us what you like about BookBridge or what we can improve. Your feedback helps us build a better platform for everyone.
fr: Dites-nous ce que vous aimez à propos de BookBridge ou ce que nous pouvons améliorer. Vos commentaires nous aident à construire une meilleure plateforme pour tous.

# feedbackHint
source: Type your feedback here...
fr: Tapez votre commentaire ici...

source: Submit Feedback
fr: Envoyer le commentaire

# feedbackAggrement
source: By submitting, you agree that your feedback may be used to improve our services.
fr: En envoyant ce formulaire, vous acceptez que vos commentaires puissent être utilisés pour améliorer nos services.

source: Get in touch
fr: Contactez-nous

# contactSubtitle
source: Have a question, feedback, or need support? We're here to help you get the most out of BookBridge.
fr: Vous avez une question, un commentaire ou besoin d'aide ? Nous sommes là pour vous aider à tirer le meilleur parti de BookBridge.

source: WhatsApp Support
fr: Support WhatsApp

# chatDirectly
source: Chat with us directly
fr: Discutez avec nous directement

source: Email Us
fr: Envoyez-nous un e-mail

# availableHours
source: Available Mon - Sat, 8 AM - 6 PM
fr: Disponible du lundi au samedi, de 8h à 18h

# privacyIntroContent
source: Welcome to BookBridge. We value your privacy and are committed to protecting your personal data. This privacy policy will inform you about how we look after your personal data when you visit our application and tell you about your privacy rights.
fr: Bienvenue sur BookBridge. Nous accordons une grande importance à votre vie privée et nous nous engageons à protéger vos données personnelles. Cette politique de confidentialité vous informera sur la manière dont nous traitons vos données personnelles lorsque vous visitez notre application et vous informera sur vos droits en matière de confidentialité.

# privacyCollectTitle
source: 2. Data We Collect
fr: 2. Données que nous collectons

# privacyCollectContent
source: We may collect, use, store and transfer different kinds of personal data about you which we have grouped together as follows: • Identity Data: Name, username or similar identifier. • Contact Data: Email address and telephone numbers (including WhatsApp). • Technical Data: IP address, login data, browser type and version, time zone setting and location. • Profile Data: Your username, password, listings made by you, your interests, and favorites.
fr: Nous pouvons collecter, utiliser, stocker et transférer différents types de données personnelles vous concernant, que nous avons regroupées comme suit : • Données d'identité : Nom, nom d'utilisateur ou identifiant similaire. • Données de contact : Adresse e-mail et numéros de téléphone (y compris WhatsApp). • Données techniques : Adresse IP, données de connexion, type et version du navigateur, fuseau horaire et localisation. • Données de profil : Votre nom d'utilisateur, votre mot de passe, les annonces que vous avez publiées, vos intérêts et vos favoris.

# privacyUseTitle
source: 3. How We Use Your Data
fr: 3. Comment nous utilisons vos données

# privacyUseContent
source: We only use your personal data when the law allows us to. Most commonly, we will use your personal data in the following circumstances: • To register you as a new user. • To facilitate the peer-to-peer marketplace (connecting buyers and sellers). • To improve our application, services, and user experience. • To manage our relationship with you.
fr: Nous n'utilisons vos données personnelles que lorsque la loi nous y autorise. Le plus souvent, nous utiliserons vos données personnelles dans les circonstances suivantes : • Pour vous enregistrer en tant que nouvel utilisateur. • Pour faciliter la place de marché de pair à pair (mise en relation des acheteurs et des vendeurs). • Pour améliorer notre application, nos services et l'expérience utilisateur. • Pour gérer notre relation avec vous.

# privacySharingTitle
source: 4. Data Sharing
fr: 4. Partage de données

# privacySharingContent
source: When you list a book, your contact information (like your WhatsApp number) will be shared with potential buyers to facilitate the transaction. We do not sell your personal data to third parties for marketing purposes.
fr: Lorsque vous mettez un livre en vente, vos informations de contact (comme votre numéro WhatsApp) seront partagées avec les acheteurs potentiels pour faciliter la transaction. Nous ne vendons pas vos données personnelles à des tiers à des fins de marketing.

# privacySecurityTitle
source: 5. Data Security
fr: 5. Sécurité des données

# privacySecurityContent
source: We have put in place appropriate security measures to prevent your personal data from being accidentally lost, used or accessed in an unauthorized way, altered or disclosed.
fr: Nous avons mis en place des mesures de sécurité appropriées pour éviter que vos données personnelles ne soient accidentellement perdues, utilisées ou consultées de manière non autorisée, modifiées ou divulguées.

# privacyRightsTitle
source: 6. Your Rights
fr: 6. Vos droits

# privacyRightsContent
source: You have the right to request access to, correction of, or erasure of your personal data. You can manage most of your data directly through your profile settings in the application.
fr: Vous avez le droit de demander l'accès à vos données personnelles, leur correction ou leur suppression. Vous pouvez gérer la plupart de vos données directement via les paramètres de votre profil dans l'application.

# lastUpdated
source: Last updated: {date}
fr: Dernière mise à jour : {date}

# termsAcceptanceTitle
source: 1. Acceptance of Terms
fr: 1. Acceptation des conditions

# termsAcceptanceContent
source: By accessing or using the BookBridge application, you agree to be bound by these Terms and Conditions. If you do not agree with any part of these terms, you may not use our service.
fr: En accédant à l'application BookBridge ou en l'utilisant, vous acceptez d'être lié par ces conditions générales. Si vous n'êtes pas d'accord avec une partie de ces conditions, vous ne pouvez pas utiliser notre service.

# termsMarketplaceTitle
source: 2. Marketplace Rules
fr: 2. Règles de la place de marché

# termsMarketplaceContent
source: BookBridge is a platform that facilitates the sale and purchase of used books between users. We are not a party to the actual transactions between buyers and sellers. • Sellers are responsible for the accuracy of their listings. • Buyers are responsible for verifying the condition of the books before purchase. • All transactions are made directly between users.
fr: BookBridge est une plateforme qui facilite la vente et l'achat de livres d'occasion entre utilisateurs. Nous ne sommes pas partie aux transactions réelles entre acheteurs et vendeurs. • Les vendeurs sont responsables de l'exactitude de leurs annonces. • Les acheteurs sont responsables de la vérification de l'état des livres avant l'achat. • Toutes les transactions sont effectuées directement entre les utilisateurs.

# termsResponsibilitiesTitle
source: 3. User Responsibilities
fr: 3. Responsabilités de l'utilisateur
