Repository: DCT-Berinyuy/book-bridge
Catalog: lib/l10n/app_*.arb
Languages: fr

# termsResponsibilitiesContent
source: You must provide accurate information when creating an account and listing books. You are prohibited from posting content that is illegal, offensive, or infringing on the rights of others.
fr: Vous devez fournir des informations exactes lors de la création d'un compte et de la mise en vente de livres. Il vous est interdit de publier du contenu illégal, offensant ou portant atteinte aux droits d'autrui.

# termsPaymentsTitle
source: 4. Payments
fr: 4. Paiements

# termsPaymentsContent
source: Payments for books are generally handled in cash upon delivery or via direct mobile money transfer between the buyer and seller. BookBridge may offer integrated payment solutions (like CamPay) for specific services or donations.
fr: Les paiements pour les livres sont généralement gérés en espèces à la livraison ou via un transfert direct d'argent mobile entre l'acheteur et le vendeur. BookBridge peut proposer des solutions de paiement intégrées (comme Fapshi) pour des services spécifiques ou des dons.

# termsLiabilityTitle
source: 5. Limitation of Liability
fr: 5. Limitation de responsabilité

# termsLiabilityContent
source: BookBridge is provided "as is" without any warranties. We are not liable for any disputes, losses, or damages arising from your use of the application or transactions with other users.
fr: BookBridge est fourni « tel quel » sans aucune garantie. Nous ne sommes pas responsables des litiges, pertes ou dommages découlant de votre utilisation de l'application ou des transactions avec d'autres utilisateurs.

# termsChangesTitle
source: 6. Changes to Terms
fr: 6. Modifications des conditions

# termsChangesContent
source: We reserve the right to modify these terms at any time. Your continued use of the application following any changes constitutes acceptance of the new terms.
fr: Nous nous réservons le droit de modifier ces conditions à tout moment. Votre utilisation continue de l'application après toute modification constitue votre acceptation des nouvelles conditions.

# faqGeneralCategory
source: General
fr: Général

# faqWhatIsBookBridgeQ
source: What is BookBridge?
fr: Qu'est-ce que BookBridge ?

# faqWhatIsBookBridgeA
source: BookBridge is a peer-to-peer marketplace designed specifically for students in Cameroon to buy and sell used physical books at affordable prices.
fr: BookBridge est une place de marché de pair à pair conçue spécifiquement pour les étudiants au Cameroun afin d'acheter et de vendre des livres physiques d'occasion à des prix abordables.

# faqCreateAccountQ
source: How do I create an account?
fr: Comment créer un compte ?

# faqCreateAccountA
source: You can sign up using your email address or quickly sign in with your Google account. After signing in, you'll need to complete your profile with a few details like your locality and WhatsApp number.
fr: Vous pouvez vous inscrire à l'aide de votre adresse e-mail ou vous connecter rapidement avec votre compte Google. Après vous être connecté, vous devrez compléter votre profil avec quelques détails comme votre localité et votre numéro WhatsApp.

# faqBuyingCategory
source: Buying Books
fr: Acheter des livres

# faqHowToBuyQ
source: How do I buy a book?
fr: Comment acheter un livre ?

# faqHowToBuyA
source: Browse the listings on the Home screen or use the search bar. When you find a book you like, tap on it to see details, then use the "Contact Seller" button to message them via WhatsApp to arrange the purchase.
fr: Parcourez les annonces sur l'écran d'accueil ou utilisez la barre de recherche. Lorsque vous trouvez un livre qui vous plaît, appuyez dessus pour voir les détails, puis utilisez le bouton « Contacter le vendeur » pour lui envoyer un message via WhatsApp afin d'organiser l'achat.

# faqHowToPayQ
source: How do I pay for a book?
fr: Comment payer un livre ?

# faqHowToPayA
source: Most transactions happen directly between the buyer and seller. You can pay in cash during a physical meeting or via Mobile Money if both parties agree. Always verify the book's condition before paying.
fr: La plupart des transactions se font directement entre l'acheteur et le vendeur. Vous pouvez payer en espèces lors d'une rencontre physique ou via Mobile Money si les deux parties sont d'accord. Vérifiez toujours l'état du livre avant de payer.

# faqNearbyBooksQ
source: Can I see books near me?
fr: Puis-je voir des livres près de chez moi ?

# faqNearbyBooksA
source: Yes! The "Your nearby books" section on the Home screen uses your location to show books available in your immediate vicinity, sorted by distance.
fr: Oui ! La section « Vos livres à proximité » sur l'écran d'accueil utilise votre position pour afficher les livres disponibles dans votre voisinage immédiat, triés par distance.

# faqSellingCategory
source: Selling Books
fr: Vendre des livres

# faqHowToListQ
source: How do I list a book for sale?
fr: Comment mettre un livre en vente ?

# faqHowToListA
source: Tap the "Sell" button in the bottom navigation bar. Upload a clear photo of the book, enter the title, author, price, and condition, then submit the listing.
fr: Appuyez sur le bouton « Vendre » dans la barre de navigation inférieure. Téléchargez une photo claire du livre, entrez le titre, l'auteur, le prix et l'état, puis soumettez l'annonce.

# faqSellingFeesQ
source: Is there a fee for selling?
fr: Y a-t-il des frais de vente ?

# faqSellingFeesA
source: Currently, listing books on BookBridge is free for individual students. We want to make it as easy as possible for you to recycle your educational resources.
fr: Actuellement, la mise en vente de livres sur BookBridge est gratuite pour les étudiants individuels. Nous voulons vous faciliter au maximum le recyclage de vos ressources éducatives.

# faqBuyBackEligibleQ
source: What is "Buy-Back Eligible"?
fr: Qu'est-ce que le « Rachat éligible » ?

# faqBuyBackEligibleA
source: Some listings from verified bookshops or the platform itself may be eligible for buy-back. This means you can sell the book back to the source at a pre-determined price once you're finished with it.
fr: Certaines annonces provenant de librairies vérifiées ou de la plateforme elle-même peuvent être éligibles au rachat. Cela signifie que vous pouvez revendre le livre à la source à un prix prédéterminé une fois que vous en avez terminé avec lui.

# faqSafetyCategory
source: Safety & Trust
fr: Sécurité et confiance

# faqTrustworthySellerQ
source: How do I know a seller is trustworthy?
fr: Comment savoir si un vendeur est digne de confiance ?

# faqTrustworthySellerA
source: Check for the "Verified" badge on listings. For individual students, we encourage meeting in safe, public locations like your school campus or a busy library to complete transactions.
fr: Recherchez le badge « Vérifié » sur les annonces. Pour les étudiants individuels, nous encourageons les rencontres dans des lieux publics et sûrs, comme le campus de votre école ou une bibliothèque fréquentée, pour conclure les transactions.

# faqProblemQ
source: What should I do if there's a problem?
fr: Que dois-je faire en cas de problème ?

# faqProblemA
source: If you encounter any issues with a transaction or another user, please use the "Feedback" or "Contact Us" options in your profile to report it to our team.
fr: Si vous rencontrez des problèmes avec une transaction ou un autre utilisateur, veuillez utiliser les options "Commentaires" ou "Contactez-nous" de votre profil pour le signaler à notre équipe.

# phoneNumberLabel
source: Phone Number (6xx...)
fr: Numéro de téléphone (6xx...)

# phoneNumberHint
source: e.g. 677777777
fr: ex. 677777777

# fieldRequired
source: Required
fr: Requis

source: Invalid number
fr: Numéro invalide

source: Pay Now
fr: Payer

source: Initiating transaction...
fr: Initiation de la transaction...

# confirmPaymentPrompt
source: Please confirm the payment request on your phone!
fr: Veuillez confirmer la demande de paiement sur votre téléphone !

source: I have paid
fr: J'ai payé

source: Payment Successful!
fr: Paiement réussi !

# continueButton
source: Continue
fr: Continuer

# faqTitle
source: Frequently Asked Questions
fr: Questions Fréquemment Posées

# privacyPolicyTitle
source: Privacy Policy
fr: Politique de Confidentialité

# termsAndConditionsTitle
source: Terms and Conditions
fr: Conditions Générales

# noListingFound
source: Listing not found
fr: Annonce introuvable

source: Language
fr: Langue

source: Select Language
fr: Choisir la langue

source: English
fr: Anglais

source: French
fr: Français
